rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
/* Heatmap CD model xSPI2 pool: same slot (0x70200000) as the scalar.
 * DS-CNN v4-S weights are pre-flashed here; the generated heatmap_cd.c
 * references _mem_pool_xSPI2_heatmap_cd for weight addressing. */
__attribute__((section(".xspi2_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_heatmap_cd[32U] = {
	0U,
};
/* Compact OBB 320 localizer pool lives in the dedicated OBB flash slot (0x70700000). so the linker script can map it to
 * the rectifier flash region at 0x70600000 ??? matching FLASH_RECTIFIER in
 * flash_boot.ps1.  The NPU resolves all weight addresses as:
 *   _mem_pool_xSPI2_mobilenetv2_rectifier_hardcase_finetune + internal_offset
 * so this symbol MUST live at the base of the flashed blob. */
__attribute__((section(".xspi2_rectifier_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_mobilenetv2_rectifier_hardcase_finetune[32U] = {
	0U,
};
/* Board bbox OBB pool lives in the dedicated OBB flash slot (0x70700000).
 * The generated network references:
 *   _mem_pool_xSPI2_obb_box_board_bbox_deploy_candidate — weight-addressing.
 * 32-byte placeholder ensures the symbol resolves at link time.
 * Actual weight blob (~664 KiB, obb_box_board_bbox_deploy_candidate_atonbuf.xSPI2.raw) is
 * flashed separately via flash_boot.ps1. */
__attribute__((section(".xspi2_obb_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_obb_box_board_bbox_deploy_candidate[32U] = {
	0U,
};

/* Board bbox OBB activation overflow (1024 KB) in xSPI1 HyperRAM.
 * The N657 Nucleo has no physical HyperRAM — this symbol resolves
 * at 0x90000000 via the .xspi1_obb_pool linker section.
 * NPU access to 0x90000000 will bus-fault at runtime. */
__attribute__((section(".xspi1_obb_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI1_obb_box_board_bbox_deploy_candidate[32U] = {
	0U,
};


/* Source-crop-box model pool (mobilenetv2_source_crop_box_v1_stripped_int8). */

__attribute__((section(".xspi2_source_crop_box_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))

uint8_t _mem_pool_xSPI2_mobilenetv2_source_crop_box_v1_stripped_int8[32U] = {

	0U,

};
#endif

/* Tip-focus SimCC model pool. The generated network keeps the xSPI2 pool
 * symbol alive at the address where the NPU weight blob
 * (simcc_gauge_v2_spatial_qat_sc128_int8_atonbuf.xSPI2.raw) is flashed
 * (0x70400000).
 *
 * IMPORTANT: The actual weights data (2.2MB) is NOT stored in this array.
 * The data lives in xSPI2 flash at 0x70400000, and must be flashed using
 * flash_boot.ps1 before running inference. This 32-byte symbol is just a
 * linker marker that gets placed at 0x70400000 by the .xspi2_tip_focus_pool
 * section. When the NPU accesses weights, it reads from xSPI2 flash through
 * the memory-mapped window (0x70000000+), not from this RAM array.
 *
 * If you see a HardFault at address 0x8D or similar during inference, it
 * means the xSPI2 flash was not programmed. Run flash_boot.ps1 to flash
 * simcc_gauge_v2_spatial_qat_sc128_int8_atonbuf.xSPI2.raw to 0x70400000. */
__attribute__((section(".xspi2_tip_focus_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_simcc_gauge_v2_spatial_qat_sc128_int8[32U] = { 0U, };
static uint8_t app_ai_xspi2_program_buffer[APP_AI_XSPI2_PROGRAM_CHUNK_BYTES];
__attribute__((aligned(APP_AI_CACHE_LINE_BYTES)))
static uint8_t app_ai_scalar_row_scratch[APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL];
__attribute__((aligned(APP_AI_CACHE_LINE_BYTES)))
static uint8_t app_ai_scalar_output_row_scratch[APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * 3U * sizeof(float)];
volatile size_t app_ai_scalar_preprocess_last_row = (size_t)SIZE_MAX;
/* Trace the scalar resize loop only every so often so we can tell whether it
 * is progressing without flooding UART in the hot path. */
#define APP_AI_SCALAR_PREPROCESS_ROW_TRACE_INTERVAL_ROWS 32U
/* Keep each preprocessing pass small enough that we can reshape the scalar
 * path without one huge monolithic row loop. */
#define APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK 8U
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
/* Start/tail signatures for the heatmap center-detector initializer blob.
 * Update these when a new model is exported by running:
 *   python3 -c "
 *     d=open('st_ai_output/packages/heatmap_cd_tiny/st_ai_output/heatmap_cd_atonbuf.AXISRAM2.raw','rb').read()
 *     print('start:', bytes(d[:16]).hex())
 *     print('tail: ', bytes(d[-16:]).hex())" */
/* Heatmap center-detector model (DS-CNN v4-S): 332,045 bytes flashed at 0x70200000.
 * Signatures unchanged from DS-CNN v4 — same first/last 16 bytes. */
static const uint8_t app_ai_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x80U, 0x80U, 0x81U, 0x82U, 0x83U, 0x83U, 0x84U, 0x85U,
	0x86U, 0x87U, 0x87U, 0x88U, 0x89U, 0x8AU, 0x8BU, 0x8BU,
};
static const uint8_t app_ai_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Rectified scalar v2 xSPI2 signatures used when the board boots with the
 * prod v0.8 scalar blob already flashed at 0x70200000. Size: 3,218,865 bytes. */
static const uint8_t app_ai_rectifier_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x0FU, 0x11U, 0xF8U, 0x10U, 0xD0U, 0xD8U, 0x0EU, 0x28U,
	0x99U, 0xCEU, 0x98U, 0x7DU, 0xBCU, 0x42U, 0x5EU, 0xF2U,
};
static const uint8_t app_ai_rectifier_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Board bbox OBB xSPI2 signatures.  Update after running:
 *   python ml/scripts/package_obb_box_board_bbox_deploy_candidate_for_n6.py
 * The script prints the 16 start/tail bytes for this raw blob. */
static const uint8_t app_ai_obb_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x34U, 0x10U, 0x10U, 0x1CU, 0x11U, 0xDFU, 0xFEU, 0x2DU,
	0xD7U, 0xB0U, 0xCFU, 0x0CU, 0x04U, 0x0FU, 0xDBU, 0x0EU,
};
static const uint8_t app_ai_obb_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x70U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
};

/* Source-crop-box xSPI2 signatures for atonbuf.source_crop_box.xSPI2.raw. */
static const uint8_t app_ai_source_crop_box_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0xF2U, 0x17U, 0x29U, 0xE2U, 0xDCU, 0xEBU, 0xECU, 0x04U,
	0x09U, 0x01U, 0x35U, 0xEBU, 0x14U, 0xDEU, 0x0FU, 0x02U,
};
static const uint8_t app_ai_source_crop_box_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
#endif
/* Tip-focus SimCC model xSPI2 signatures for
 * network_atonbuf.xSPI2.raw.
 * Flashed to 0x70400000. Size: 2,201,505 bytes. */
static const uint8_t app_ai_tip_focus_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x04U, 0x2FU, 0x1FU, 0xF2U, 0x62U, 0xE7U, 0x3EU, 0xFDU,
	0x0AU, 0x1EU, 0xF4U, 0x32U, 0xD4U, 0x9AU, 0xFEU, 0xC2U,
};
static const uint8_t app_ai_tip_focus_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
/* Per-stage programmed sizes. Set during provisioning and used by the verify
 * functions for the tail probe offset. Keeping them separate prevents the
 * scalar tail check from using the rectifier's file size (or vice-versa) when
 * stages alternate. */
static ULONG app_ai_scalar_programmed_size = 0UL;
static ULONG app_ai_rectifier_programmed_size = 0UL;
static ULONG app_ai_obb_programmed_size = 0UL;
static ULONG app_ai_source_crop_box_programmed_size = 0UL;

/* Per-stage signature caches populated from the SD file during provisioning.
 * Using SD-sourced bytes means verify never goes stale when the model blob is
 * replaced, regardless of what the hardcoded fallback constants say. */
static uint8_t app_ai_scalar_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_scalar_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_scalar_sig_valid = false;
static uint8_t app_ai_rectifier_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_rectifier_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_rectifier_sig_valid = false;
static uint8_t app_ai_obb_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_obb_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_obb_sig_valid = false;
static uint8_t app_ai_source_crop_box_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_source_crop_box_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_source_crop_box_sig_valid = false;
#endif
/* Legacy alias kept for the shared xSPI2 logging helpers; the live tip-focus
 * build still expects this size tracker to exist. */
static ULONG app_ai_xspi2_programmed_size = 0UL;
static ULONG app_ai_tip_focus_programmed_size = 0UL;
static uint8_t app_ai_tip_focus_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static uint8_t app_ai_tip_focus_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
static bool app_ai_tip_focus_sig_valid = false;

/* Declare the generated NN instance locally so the dry-run helper can run the
 * AtoNN runtime on the exact network produced by Cube.AI. */
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	scalar_full_finetune_from_best_piecewise_calibrated_int8);
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	mobilenetv2_rectifier_hardcase_finetune);
/* Board bbox OBB deploy candidate — single-model localizer.
 * Outputs 3 int8 tensors decoded by app_qarepvgg_decode.inc. */
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	obb_box_board_bbox_deploy_candidate);
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	mobilenetv2_source_crop_box_v1_stripped_int8);
/* Heatmap center detector replaces the scalar CNN as the sole inference
 * authority. Its weight blob lives at 0x70200000 (the old scalar slot). */
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
	heatmap_cd);

typedef struct
{
	float center_x;
	float center_y;
	float box_w;
	float box_h;
} AppAI_RectifierBox;

